# ============================================================================
# CoderCo Brewfile
# Installation: brew bundle --file=Brewfile
# ============================================================================

# ----------------------------------------------------------------------------
# Shell & Terminal
# ----------------------------------------------------------------------------
brew 'zsh'
brew 'bash'
brew 'bash-completion'
brew 'oh-my-zsh'
brew 'powerlevel10k'
brew 'zsh-syntax-highlighting'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'tmux'
brew 'screen'
cask 'iterm2'

# ----------------------------------------------------------------------------
# Development Tools
# ----------------------------------------------------------------------------
brew 'git'
brew 'gh'
brew 'gitsign'
brew 'node'
brew 'ruby'
brew 'python@3.10'
brew 'python@3.9'
brew 'python3'
brew 'go'
brew 'rust'
cask 'visual-studio-code'
cask 'goland'

# ----------------------------------------------------------------------------
# Language Version Managers
# ----------------------------------------------------------------------------
brew 'pyenv'
brew 'tfenv'
brew 'nvm'

# ----------------------------------------------------------------------------
# Go Tools
# ----------------------------------------------------------------------------
brew 'golangci-lint'
brew 'goreleaser'
brew 'gotests'

# ----------------------------------------------------------------------------
# Infrastructure as Code
# ----------------------------------------------------------------------------
brew 'terraform'
brew 'terragrunt'
brew 'vault'
brew 'hadolint'

# ----------------------------------------------------------------------------
# Kubernetes Tools
# ----------------------------------------------------------------------------
brew 'kubernetes-cli'
brew 'kubectx'
brew 'kube-ps1'
brew 'krew'
brew 'kubeseal'
brew 'helm'
brew 'k3d'
brew 'kind'
brew 'minikube'
brew 'skaffold'
brew 'kustomize'
brew 'tilt'

# ----------------------------------------------------------------------------
# Container Tools
# ----------------------------------------------------------------------------
brew 'docker-machine-driver-hyperkit'
brew 'dive'
brew 'crane'

# ----------------------------------------------------------------------------
# Cloud Tools
# ----------------------------------------------------------------------------
brew 'localstack'
brew 'multipass'
brew 'lima'
brew 'qemu'
brew 'traefik'

# ----------------------------------------------------------------------------
# DevOps Tools
# ----------------------------------------------------------------------------
brew 'jfrog-cli'
brew 'jq'
brew 'yq'
brew 'task'
brew 'opa'
brew 'cfssl'
brew 'ko'

# ----------------------------------------------------------------------------
# System Tools & Utilities
# ----------------------------------------------------------------------------
brew 'make'
brew 'tree'
brew 'wget'
brew 'vim'
brew 'perl'
brew 'postgresql@14'
brew 'libssh'
brew 'bash'
brew 'bash-completion'
brew 'fzf'
brew 'grv'
brew 'ripgrep'
brew 'fd'
brew 'direnv'
brew 'bats'
brew 'tldr'
brew 'shellcheck'
brew 'telnet'
brew 'proctools'
brew 'pstree'
brew 'coreutils'
brew 'findutils'
brew 'grep'
brew 'less'
brew 'gawk'
brew 'gnutls'
brew 'parallel'
brew 'ncdu'
brew 'watch'

# ----------------------------------------------------------------------------
# Security & Encryption
# ----------------------------------------------------------------------------
brew 'gnupg'
brew 'gpg'
cask 'keybase'

# ----------------------------------------------------------------------------
# Desktop Applications
# ----------------------------------------------------------------------------
cask 'clipy'
cask 'vimac'
cask 'zoomus'
cask 'flux'
cask 'slack'
cask 'rectangle'
cask 'google-chrome'
cask 'coconutbattery'
cask 'firefox'
cask 'discord'

# ----------------------------------------------------------------------------
# VS Code Extensions
# ----------------------------------------------------------------------------
vscode 'bierner.markdown-mermaid'
vscode 'DavidAnson.vscode-markdownlint'
vscode 'dbaeumer.vscode-eslint'
vscode 'eamodio.gitlens'
vscode 'ecmel.vscode-html-css'
vscode 'GitHub.copilot'
vscode 'GitHub.copilot-chat'
vscode 'github.vscode-github-actions'
vscode 'GitHub.vscode-pull-request-github'
vscode 'golang.go'
vscode 'hashicorp.terraform'
vscode 'hediet.vscode-drawio'
vscode 'JFrog.jfrog-vscode-extension'
vscode 'johnpapa.winteriscoming'
vscode 'mongodb.mongodb-vscode'
vscode 'ms-azuretools.vscode-bicep'
vscode 'ms-azuretools.vscode-docker'
vscode 'ms-dotnettools.csharp'
vscode 'ms-dotnettools.vscode-dotnet-runtime'
vscode 'ms-kubernetes-tools.vscode-aks-tools'
vscode 'ms-kubernetes-tools.vscode-kubernetes-tools'
vscode 'ms-python.isort'
vscode 'ms-python.python'
vscode 'ms-python.vscode-pylance'
vscode 'ms-toolsai.jupyter'
vscode 'ms-toolsai.jupyter-keymap'
vscode 'ms-toolsai.jupyter-renderers'
vscode 'ms-toolsai.vscode-jupyter-cell-tags'
vscode 'ms-toolsai.vscode-jupyter-slideshow'
vscode 'ms-vscode-remote.remote-containers'
vscode 'ms-vscode-remote.remote-ssh'
vscode 'ms-vscode-remote.remote-ssh-edit'
vscode 'ms-vscode.azure-account'
vscode 'ms-vscode.makefile-tools'
vscode 'ms-vscode.powershell'
vscode 'ms-vscode.remote-explorer'
vscode 'ms-vsliveshare.vsliveshare'
vscode 'oderwat.indent-rainbow'
vscode 'pranaygp.vscode-css-peek'
vscode 'puppet.puppet-vscode'
vscode 'redhat.vscode-yaml'
vscode 'ritwickdey.LiveServer'
vscode 'run-at-scale.terraform-doc-snippets'
vscode 'tilt-dev.tiltfile'
vscode 'tsandall.opa'
vscode 'vscode-icons-team.vscode-icons'
vscode 'vscodevim.vim'
vscode 'xabikos.JavaScriptSnippets'
vscode 'yzhang.markdown-all-in-one'
